"""
파일명 : day16-04-addressBook
개요 : 주소록 프로젝트
page : 352
"""

'''
주소록 프로젝트
- 이름, 전화번호, 주소 정보를 포함하고있는 주소록이며 
모든 데이터를 파일에 보관하는 방식으로 동작
'''

'''
1. 프로젝트 개요
- 주소록 프로젝트를 통해서 구현하고자 하는 기능은 다음과 같습니다.

[ 요구 사항 ]
- 새로운 정보를 주소록에 등록하기
- 기존 주소록 정보를 삭제하기
- 기존 주소록 정보를 수정하기
- 특정 주소록 정보를 검색하기
- 전체 주소록 정보를 출력하기
- 전체 주소록 정보를 파일로 관리하기

[ 구현 방식 ]
- 개별 정보를 저장할 Person클래스와 전체 주소록을 관리할 AddressBook클래스를 도입
    -> 객체지향 프로그래밍 방식
- 프로그램이 종료되더라도 주소록의 내용을 저장할 수 있도록 addressBook.csv 파일을 사용
- 프로그램 시작시 addressBook.csv 파일의 내용 로드
    -> 기존 주소록 정보를 활용할 수 있음.
    -> 추가/수정/삭제 작업 시 addressBook.csv 파일의 내용이 업데이트 되도록 변경 
'''






















