"""
파일 : day13-03-data_structure
개요 : 자료구조1_LinkedList
Page : X
"""

'''
1. 자료구조가 필요한 이유
- 데이터를 효율적으로 저장, 관리하여 메모리를 효율적으로 사용하기 위함.
- 적정한 자료구조의 사용은 메모리의 용량을 절약 -> 실행시간의 단축

[ 현실적인 필요한 이유 ]
- 알고리즘을 위한 기초 지식
- 효율적인 메모리 사용 -> 효율적인 코딩 ( 클린 코딩 )
'''

'''
2. 알고리즘 ???
- 일을 효율적으로 처리하기 위한 절차
- 어떠한 일을 처리하는 절차 및 순서 
'''

'''
문제 ) 아침에 침대에서 일어난 뒤 냉장고에 있는 우유를 이용해서
컵 받침대에 있는 새로운 컵으로 그 우유를 마시는 순서를 만들어보세요.

1. 침대에서 일어난다.
2. 냉장고 앞으로 간다.
3. 우유가 있는 냉장고 문을 열고 
4. 우유를 꺼낸다 
5. 컵 받침대 앞으로 이동한다.
6. 컵 받침대에 있는 새로운 컵을 꺼낸다. 
7. 새로운 컵을 식탁에 놓는다.
8. 우유의 뚜껑을 연다.
9. 새로운 컵에 우유를 컵의 중간까지 붓는다
10. 우유의 뚜껑을 닫는다. 
end. 컵을 들어서 컵에 있는 우유를 마신다.

* 여기서의 자료구조는 컵을 생각해보면된다.
-> 컵의 중간까지 따라서 마신다고 했습니다.
    -- 그럼? 컵의 크기가 커지거나 작아지면 어떻게될까? 
    -> 컵이 커지면 커질수록 우유를 많이 따라서 마셔야한다.
        --> 배가 부를수 있다.
    적절한 컵의 사용이 중요!!!
        -> 다른 컵을 사용한다고 못 마시는 건 아님.
        
* 참고
유튜브 -> 코딩이 필요한 이유 -> 첫번째 영상  
'''

'''
3. 자료 구조의 종류
[ 자료구조의 종류 ]
-- 선형 구조
    ㄴ 배열 ( Array )
    ㄴ 링크드 리스트 ( Linked List )
    ㄴ 스택 ( Stack )
    ㄴ 큐 ( Queue )
-- 비선형 구조
    ㄴ 트리 ( Tree ) *** 
    
[ Python 에서의 자료 구조 종류 ]
- 튜플 ( Tuple )
- 리스트 ( List )
- 딕셔너리 ( Dict )
- 세트 ( Set )
'''









