"""
파일명 : day06-04-inner_function
개요 : 내장 함수
page : 146
"""

'''
1. 내장 함수란 ?
파이썬 인터프리터에는 항상 사용할 수 있는 많은 함수가 내장되어 있으며,
이를 내장 함수라고 합니다.

외부에 따로 저장해 둔 모듈에서 불러오는 것이 아니기 때문에
import가 필요하지 않습니다. 이미 우리는 print() 함수나 input() 함수와 같은
내장 함수를 사용해봄.
이번 챕터에서는 많은 내장 함수에 대해 알아보자.
'''
'''
2. 내장 함수의 종류
# dict()
# enumerate() : for문에서 보편적으로 사용하며 index가 필요할 때 사용함.
# isinstance() ** 나중에 클래스 쪽 배울때 알 수 있음.
# len() : ()안에 반복할 수 있는 객체 속 요소의 갯수를 반환
# print() : 출력
# range() : 범위 생성
# str() : ()안에 있는 객체를 문자열로 변경
'''








